/** 更多样式 http://developer.baidu.com/map/custom/list.htm */
var MAP_STYLE = "bluish";

var DATA = {
	"上海市" : {
		"上海交通大学" : ["刘璜逸"],
		"上海海关学院" : ["张宾煜"],
		"华东理工大学" : ["张越"]
	},

	"广州市" : {
		"中山大学" : ["董子翼", "郭怀泽"]
	},

	"北京市" : {
		"北京理工大学" : ["郭洁"],
		"北京化工大学" : ["赵雨涵","杜世阳"],
		"中国人民公安大学" : ["马树浚", "张鹏"],
		"中国地质大学（北京）" : ["来繁岩"],
		"中国石油大学" : ["尚艺"]
	},
	"天津市" : {
		"南开大学" : ["韩睿", "元绍昶"],
		"天津大学" : ["崔译文", "王卓", "于倩","于光辉"],
		"天津师范大学" : ["杨蕊", "孙昌松"],
		"天津财经大学" : ["刘宵华", "李承成", "赵浩羽"],
		"河北工业大学" : ["吴璇"],
		"天津工业大学" : ["张佳岑"]
	},
	"无锡市" : {
		"江南大学" : ["肖厚东", "王展传"]
	},
	"武汉市" : {
		"武汉大学" : ["吴佳俊"],
		"华中科技大学" : ["张洪馨"],
		"武汉理工大学" : ["刘硕"],
		"华中农业大学" : ["张艺元"],
		"海军工程大学" : ["左天佑"]
	},
	"重庆市" : {
		"重庆师范大学" : ["李国洋"]
	},
	"合肥市" : {
		"合肥工业大学" : ["于耀翔"]
	},
	"吉林市" : {
		"吉林大学" : ["王彦桥"]
	},
	"南京市" : {
		"南京理工大学" : ["聂金晨"],
		"南京航空航天大学" : ["朱英杰"]
	},
	
	"陕西市" : {
		"西北农林科技大学" : ["杨靖源"]
	},
	"西安市" : {
		"西安交通大学" : ["刘清怡"],
		"西安建筑科技大学" : ["尚奎达"]
	},
	"四川省" : {
		"四川大学" : ["郝珊"]
	},

	"保定市" : {
		"华北电力大学(保定）" : ["刘子昂"]
	},
	"长沙市" : {
		"长沙理工大学" : ["李庆伟"]
	},
	"兰州市" : {
		"兰州大学" : ["张心蕊"]
	}
};

var SPEC_POS = {
	"南开大学" : [117.17546,39.109442],
	"上海交通大学" : [121.443287,31.03201],
	"武汉大学" : [114.365818,30.534872],
	"西安交通大学" : [108.990166,34.252359],
	"华中科技大学" : [114.419825,30.518659],
	"四川大学" : [104.005145,30.562814],
	"天津大学" : [117.180115,39.116464],
	"华东理工大学" : [121.430226,31.149538],
	"天津师范大学" : [117.132025,39.069342],
	"合肥工业大学" : [117.302991,31.84747],
	"北京理工大学" : [116.322726,39.966659],
	"中国石油大学" : [116.253981,40.224412],
	"天津师范大学" : [117.132025,39.069342],
	"北京化工大学" : [116.427674,39.977968],
	"西北农林科技大学" : [108.079342,34.291642],
	"海军工程大学" : [114.247463,30.582487],
	"中国人民公安大学" : [116.37251,39.771627],
	"天津财经大学" : [117.284786,39.067009],
	"华北电力大学（保定）" : [115.511979,38.883008],
	"南京理工大学" : [118.863418,32.03162],
	"吉林大学" : [125.300812,43.854652],
	"天津工业大学" : [117.117765,39.073258],
	"江南大学" : [120.285164,31.489853],
	"西安建筑科技大学" : [108.973163,34.243736],
	"重庆师范大学" : [106.463185,29.562844],
	"河北工业大学" : [117.065012,39.244095],
	"长沙理工大学" : [112.983119,28.1582],
	"中国地质大学（北京）" : [116.354524,39.996876],
	"南京航空航天大学" : [119.493086,31.377423],
	"上海海关学院" : [121.584489,31.174944],
	"武汉理工大学" : [114.357936,30.526212],
	"华中农业大学" : [114.363708,30.48178],
	"兰州大学" : [103.866202,36.052393],
	"中山大学" : [113.304864,23.102915]

};

var MAP_TITLE = "静海一中2022届7班毕业去向 班主任：刘瑞";

var ABOUT = {
	"地图作者" : ["刘璜逸","于光辉"],
	"源码作者" : ["Yuehao"],
	"框架" : ["<a href='https://github.com/yuehaowang/irmap' target='_blank'>irmap</a>", "Bootstrap", "百度地图"]
};